[
    {
        "name": "Command Re-Roll",
        "type": "Battle Tactic",
        "cost": 1,
        "when": "In any phase, just after you have made a Hit roll, a Wound roll, a Damage roll, a saving throw, an Advance roll, a Charge roll, a Desperate Escape test, a Hazardous test, or just after you have rolled the dice to determine the number of attacks made with a weapon, for an attack, model or unit from your army.",
        "effect": "You re-roll that roll, test or saving throw."
    },
    {
        "name": "Counter-Offensive",
        "type": "Strategic Ploy",
        "cost": 2,
        "when": "Fight phase, just after an enemy unit has fought.",
        "target": "One unit from your army that is within Engagement Range of one or more enemy units and that has not already been selected to fight this phase.",
        "effect": "Your unit fights next."
    },
    {
        "name": "Epic Challenge",
        "type": "Epic Deed",
        "cost": 1,
        "when": "Fight phase, when a Character unit from your army that is within Engagement Range of one or more Attached units is selected to fight.",
        "target": "One Character model in your unit.",
        "effect": "Until the end of the phase, all melee attacks made by that model have the [PRECISION] ability."
    },
    {
        "name": "Fire Overwatch",
        "type": "Strategic Ploy",
        "cost": 1,
        "when": "Your opponent’s Movement or Charge phase, just after an enemy unit is set up or when an enemy unit starts or ends a Normal, Advance, Fall Back or Charge move.",
        "target": "One unit from your army that is within 24\" of that enemy unit and that would be eligible to shoot if it were your Shooting phase.",
        "effect": "If that enemy unit is visible to your unit, your unit can shoot that enemy unit as if it were your Shooting phase.",
        "restrictions": "You cannot target a Titanic unit with this Stratagem. Until the end of the phase, each time a model in your unit makes a ranged attack, an unmodified Hit roll of 6 is required to score a hit, irrespective of the attacking weapon’s Ballistic Skill or any modifiers."
    },
    {
        "name": "Go to Ground",
        "type": "Battle Tactic",
        "cost": 1,
        "when": "Your opponent’s Shooting phase, just after an enemy unit has selected its targets.",
        "target": "One Infantry unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
        "effect": "Until the end of the phase, all models in your unit have a 6+ invulnerable save and have the Benefit of Cover."
    },
    {
        "name": "Grenade",
        "type": "Wargear",
        "cost": 1,
        "when": "Your Shooting phase.",
        "target": "One Grenades unit from your army that is not within Engagement Range of any enemy units and has not been selected to shoot this phase.",
        "effect": "Select one enemy unit that is not within Engagement Range of any units from your army and is within 8\" of and visible to your Grenades unit. Roll six D6: for each 4+, that enemy unit suffers 1 mortal wound."
    },
    {
        "name": "Heroic Intevention",
        "type": "Strategic Ploy",
        "cost": 2,
        "when": "Your opponent’s Charge phase, just after an enemy unit ends a Charge move.",
        "target": "One unit from your army that is within 6\" of that enemy unit and would be eligible to declare a charge against that enemy unit if it were your Charge phase.",
        "effect": "Your unit now declares a charge that targets only that enemy unit, and you resolve that charge as if it were your Charge phase.",
        "restrictions": "You can only select a Vehicle unit from your army if it is a Walker. Note that even if this charge is successful, your unit does not receive any Charge bonus this turn."
    },
    {
        "name": "Insane Bravery",
        "type": "Epic Deed",
        "cost": 1,
        "when": "Battle-shock step of your Command phase, just before you take a Battle-shock test for a unit from your army.",
        "target": "A unit from your army that must take a Battle-shock test.",
        "effect": "Your unit automatically passes that Battle-shock test.",
        "restrictions": "You cannot use this Stratagem more than once per battle."
    },
    {
        "name": "Rapid Ingress",
        "type": "Strategic Ploy",
        "cost": 1,
        "when": "End of your opponent’s Movement phase.",
        "target": "One unit from your army that is in Reserves.",
        "effect": "Your unit can arrive on the battlefield as if it were the Reinforcements step of your Movement phase.",
        "restrictions": "You cannot use this Stratagem to enable a unit to arrive on the battlefield during a battle round it would not normally be able to do so in."
    },
    {
        "name": "Smokescreen",
        "type": "Wargear",
        "cost": 1,
        "when": "Your opponent’s Shooting phase, just after an enemy unit has selected its targets.",
        "target": "One Smoke unit from your army that was selected as the target of one or more of the attacking unit’s attacks.",
        "effect": "Until the end of the phase, all models in your unit have the Benefit of Cover and the Stealth ability."
    },
    {
        "name": "Tank Shock",
        "type": "Strategic Ploy",
        "cost": 1,
        "when": "Your Charge phase.",
        "target": "One Vehicle unit from your army.",
        "effect": "Until the end of the phase, after your unit ends a Charge move, select one enemy unit within Engagement Range of it, then select one melee weapon your unit is equipped with. Roll a number of D6 equal to that weapon’s Strength characteristic. If that Strength characteristic is greater than that enemy unit’s Toughness characteristic, roll two additional D6. For each 5+, that enemy unit suffers 1 mortal wound (to a maximum of 6 mortal wounds)."
    }
]
